case/porosityPrec/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            fixedValue;
        value           0;
    }
    sphere1
    {
        type            zeroGradient;
    }
    sphere2
    {
        type            zeroGradient;
    }
    sphere3
    {
        type            zeroGradient;
    }
    sphere4
    {
        type            zeroGradient;
    }
    periodicWall
    {
        type            symmetry;
    }
    "proc.*"
    {
        type    processor;
    }
}


// ************************************************************************* //
